package com.unitsvc.kit.core.field.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 功能描述：字段格式化枚举值
 *
 * @author : jun
 * @version : v1.0.0
 * @date : 2023/2/23 13:19
 **/
@Getter
@AllArgsConstructor
public enum UniFieldFmtEnum {

    // -------------------------------------------- 数字类型格式化展示 ----------------------------------------------------
    // 说明：默认展示原始数据精度
    /**
     * 保留整数部分
     */
    ROUND_0("0", "保留整数部分"),

    /**
     * 保留小数点后1位
     */
    ROUND_1("1", "保留小数点后1位"),

    /**
     * 保留小数点后2位
     */
    ROUND_2("2", "保留小数点后2位"),

    /**
     * 保留小数点后3位
     */
    ROUND_3("3", "保留小数点后3位"),

    /**
     * 保留小数点后4位
     */
    ROUND_4("4", "保留小数点后4位"),

    /**
     * 保留小数点后5位
     */
    ROUND_5("5", "保留小数点后5位"),

    /**
     * 保留小数点后6位
     */
    ROUND_6("6", "保留小数点后6位"),

    /**
     * 保留小数点后7位
     */
    ROUND_7("7", "保留小数点后7位"),

    /**
     * 保留小数点后8位
     */
    ROUND_8("8", "保留小数点后8位"),

    /**
     * 保留小数点后9位
     */
    ROUND_9("9", "保留小数点后9位"),

    /**
     * 保留小数点后10位
     */
    ROUND_10("10", "保留小数点后10位"),

    /**
     * 保留小数点后11位
     */
    ROUND_11("11", "保留小数点后11位"),

    /**
     * 保留小数点后12位
     */
    ROUND_12("12", "保留小数点后12位"),

    /**
     * 保留小数点后13位
     */
    ROUND_13("13", "保留小数点后13位"),

    /**
     * 保留小数点后14位
     */
    ROUND_14("14", "保留小数点后14位"),

    /**
     * 保留小数点后15位
     */
    ROUND_15("15", "保留小数点后15位"),

    // ---------------------------------------------------- 时间类型格式化展示 --------------------------------------------
    // 默认展示13位时间戳
    /**
     * 展示年月，示例：2022-11
     */
    DATE_YM_0("yyyy-MM", "展示年月|yyyy-MM"),

    /**
     * 展示年月，示例：2022/11
     */
    DATE_YM_1("yyyy/MM", "展示年月|yyyy/MM"),

    /**
     * 展示年月日，示例：2022-11-25
     */
    DATE_YMD_0("yyyy-MM-dd", "展示年月日|yyyy-MM-dd"),

    /**
     * 展示年月日，示例：2022/11/25
     */
    DATE_YMD_1("yyyy/MM/dd", "展示年月日|yyyy/MM/dd"),

    /**
     * 展示年月日，示例：2023/1/4
     */
    DATE_YMD_2("yyyy/M/d", "展示年月日|yyyy/M/d"),

    /**
     * 展示年月日时分，示例：2022-11-25 14:00
     */
    DATE_YMD_HM_0("yyyy-MM-dd HH:mm", "展示年月日时分|yyyy-MM-dd HH:mm"),

    /**
     * 展示年月日时分，示例：2022/11/25 14:00
     */
    DATE_YMD_HM_1("yyyy/MM/dd HH:mm", "展示年月日时分|yyyy/MM/dd HH:mm"),

    /**
     * 展示年月日时分秒，示例：2022-11-25 14:00:00
     */
    DATE_YMD_HMS_0("yyyy-MM-dd HH:mm:ss", "展示年月日时分秒|yyyy-MM-dd HH:mm:ss"),

    /**
     * 展示年月日时分秒，示例：2022/11/25 14:00:00
     */
    DATE_YMD_HMS_1("yyyy/MM/dd HH:mm:ss", "展示年月日时分秒|yyyy/MM/dd HH:mm:ss"),

    ;

    /**
     * 格式化
     */
    private final String format;

    /**
     * 中文名称
     */
    private final String nameCn;

}
