package com.unitsvc.kit.core.excel.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 功能描述：单元格格式化枚举
 *
 * @author : jun
 * @version : v1.0.0
 * @date : 2023/2/23 13:19
 **/
@Getter
@AllArgsConstructor
public enum UniExcelFmtLabelEnum {

    // -------------------------------------------------- 单元格属性格式化 --------------------------------------------------

    /**
     * 强制单元格为文本类型
     * <p>
     * 例如：01010、2023-01-04，若为常规类型则当前单元格数据类型修改后容易改变成数值或者其它格式时间类型
     */
    FORMAT_TEXT("@", "强制单元格为文本类型", "强制设置常规类型单元格为文本类型，而不是常规类型，仅对表头为字符串所在列生效"),

    /**
     * 生成布尔值下拉选项
     * <p>
     * 说明：与BOOL开头标签配合使用才生效，且优先级较高
     */
    OPTIONS_BOOL("\\|", "生成布尔值下拉选项", "生成布尔值下拉框选项，与布尔类型标签配合使用才生效，且优先级较高"),

    // -------------------------------------------------- 单元格宽度标签 --------------------------------------------------

    /**
     * 单元格宽度设置为10
     * <p>
     * 说明：适用于姓名、年龄等
     */
    WIDTH_10("10", "单元格宽度设置为10", "单元格宽度为10，适用于姓名、年龄等"),

    /**
     * 单元格宽度设置为15
     * <p>
     * 说明：适用于年月日时间、布尔等
     */
    WIDTH_15("15", "单元格宽度设置为15", "单元格宽度为15，适用于年月日时间、布尔等"),

    /**
     * 单元格宽度设置为20
     * <p>
     * 说明：适用于年月日时分秒时间、雪花算法主键等
     */
    WIDTH_20("20", "单元格宽度设置为20", "单元格宽度为20，适用于年月日时分秒时间、雪花算法主键等"),

    // -------------------------------------------------- 数字类型格式化 --------------------------------------------------

    /**
     * 保留整数
     */
    NUMBER_0("0", "保留整数", "单元格只保留整数部分"),

    /**
     * 保留一位小数
     */
    NUMBER_1("1", "保留一位小数", "单元格展示小数点后一位小数"),

    /**
     * 保留两位小数
     */
    NUMBER_2("2", "保留两位小数", "单元格展示小数点后两位小数"),

    /**
     * 保留十位小数
     */
    NUMBER_10("10", "保留十位小数", "单元格展示小数点后十位小数"),

    /**
     * 保留十五位小数
     * <p>
     * 备注：表格最多支持15位小数
     */
    NUMBER_15("15", "保留十五位小数", "单元格展示小数点后十五位小数"),

    /**
     * 以文本格式展示实际数值
     * <p>
     * 备注：表格最多展示9位小数
     */
    NUMBER_TEXT("@", "以文本格式展示实际数值", "单元格以文本格式展示实际数值，但是最多展示九位小数"),

    // ------------------------------------------------------ 时间类型格式化 ----------------------------------------------

    /**
     * 展示年月，示例：2022-11
     */
    DATE_YM_0("yyyy-MM", "展示年月|yyyy-MM", "示例：单元格展示2022-11"),

    /**
     * 展示年月，示例：2022/11
     */
    DATE_YM_1("yyyy/MM", "展示年月|yyyy/MM", "示例：单元格展示2022/11"),

    /**
     * 展示年月日，示例：2022-11-25
     */
    DATE_YMD_0("yyyy-MM-dd", "展示年月日|yyyy-MM-dd", "示例：单元格展示2022-11-25"),

    /**
     * 展示年月日，示例：2022/11/25
     */
    DATE_YMD_1("yyyy/MM/dd", "展示年月日|yyyy/MM/dd", "示例：单元格展示2022/11/25"),

    /**
     * 展示年月日，示例：2023/1/4
     */
    DATE_YMD_2("yyyy/M/d", "展示年月日|yyyy/M/d", "示例：单元格展示2023/1/4"),

    /**
     * 展示年月日时分，示例：2022-11-25 14:00
     */
    DATE_YMD_HM_0("yyyy-MM-dd HH:mm", "展示年月日时分|yyyy-MM-dd HH:mm", "示例：单元格展示2022-11-25 14:00"),

    /**
     * 展示年月日时分，示例：2022/11/25 14:00
     */
    DATE_YMD_HM_1("yyyy/MM/dd HH:mm", "展示年月日时分|yyyy/MM/dd HH:mm", "示例：单元格展示2022/11/25 14:00"),

    /**
     * 展示年月日时分秒，示例：2022-11-25 14:00:00
     */
    DATE_YMD_HMS_0("yyyy-MM-dd HH:mm:ss", "展示年月日时分秒|yyyy-MM-dd HH:mm:ss", "示例：单元格展示2022-11-25 14:00:00"),

    /**
     * 展示年月日时分秒，示例：2022/11/25 14:00:00
     */
    DATE_YMD_HMS_1("yyyy/MM/dd HH:mm:ss", "展示年月日时分秒|yyyy/MM/dd HH:mm:ss", "示例：单元格展示2022/11/25 14:00:00"),

    // ------------------------------------------------------ 布尔类型格式化 ----------------------------------------------

    /**
     * 展示是否
     */
    BOOL_YN_CN("是|否", "展示是|否", "示例：单元格下拉展示是|否，与下拉标签搭配使用"),

    /**
     * 展示Y|N
     */
    BOOL_YN_EN("Y|N", "展示Y|N类型布尔值", "示例：单元格下拉展示Y|N，与下拉标签搭配使用"),

    /**
     * 展示TRUE|FALSE
     */
    BOOL_TF_UPPER("TRUE|FALSE", "展示TRUE|FALSE类型布尔值", "示例：单元格下拉展示TRUE|FALSE，与下拉标签搭配使用"),

    /**
     * 展示true|false
     */
    BOOL_TF_LOWER("true|false", "展示true|false类型布尔值", "示例：单元格下拉展示true|false，与下拉标签搭配使用"),

    /**
     * 展示1|0
     */
    BOOL_10_NUM("1|0", "展示1|0类型布尔值", "示例：单元格下拉展示1|0与下拉标签搭配使用");

    /**
     * 格式化
     */
    private final String format;

    /**
     * 枚举中文名称
     */
    private final String nameCn;

    /**
     * 枚举描述
     */
    private final String desc;

}
